Revit 2024 API
DirectShape.ApplicationDataId Property
 A text string that identifies the data to the creating application.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public string ApplicationDataId { get; set; }
Visual Basic
Public Property ApplicationDataId As String
	Get
	Set
Visual C++
public:
property String^ ApplicationDataId {
	String^ get ();
	void set (String^ value);
}
Remarks
 The intended use is to enable the creating application to identify the native data that was the source of this DirectShape. However, the creating application may use any text string as appropriate for its purposes, or leave this property unset.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
DirectShape Class
Autodesk.Revit.DB Namespace